commands_templates/SetHostname0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/device/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:SetHostname>
         <!--type: token-->
         <wsdl:Name>?</wsdl:Name>
      </wsdl:SetHostname>
   </soap:Body>
</soap:Envelope>